app/controllers/genio_controller.rb

SELECT "arbols".* FROM "arbols" WHERE "arbols"."id" = ? LIMIT 1  [["id", 1]]
---
  def pregunta
    if session[:arbol] == nil
      session[:arbol] = 1
    end

    arbol = Arbol.find session[:arbol]

SELECT "arbols".* FROM "arbols" WHERE "arbols"."id" = ? LIMIT 1  [["id", 1]]
---
  def respuesta
    respuesta = params[:respuesta]
    arbol = Arbol.find session[:arbol]

SELECT "arbols".* FROM "arbols" WHERE "arbols"."id" = ? LIMIT 1  [["id", 1]]
---
  def pregunta_final
    arbol = Arbol.find session[:arbol]

SELECT "arbols".* FROM "arbols" WHERE "arbols"."id" = ? LIMIT 1  [["id", 1]]
---
  def respuesta_final
    @animal = Arbol.find(session[:arbol]).carga

SELECT "arbols".* FROM "arbols" WHERE "arbols"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "arbols" ("carga", "created_at", "derecha", "izquierda", "updated_at") VALUES (?, ?, ?, ?, ?)  [["carga", "perro"], ["created_at", Thu, 11 Apr 2013 12:22:07 UTC +00:00], ["derecha", nil], ["izquierda", nil], ["updated_at", Thu, 11 Apr 2013 12:22:07 UTC +00:00]]
UPDATE "arbols" SET "carga" = 'ladra', "izquierda" = 3, "derecha" = 4, "updated_at" = '2013-04-11 13:13:37.532084' WHERE "arbols"."id" = 1
---
  def learn
    @animal = Arbol.find(session[:arbol])

    animal = params[:animal]
    diferencia = params[:diferencia]
    respuesta = params[:respuesta]

    nuevo_animal = Arbol.create :carga => animal
    antiguo_animal = Arbol.create :carga => @animal.carga
    @animal.carga = diferencia

    if respuesta == 'si'
      @animal.izquierda = antiguo_animal.id
      @animal.derecha = nuevo_animal.id
    else
      @animal.izquierda = nuevo_animal.id
      @animal.derecha = antiguo_animal.id
    end
    @animal.save